In [1]:
import pyspark
import findspark
findspark. init()

In [2]:
from pyspark import SparkContext
from pyspark import SparkConf

In [3]:
import pandas as pd
pd.read_csv('fake.csv')

       Name  Age  Experience    Salary     Departments
0      John   40            5    35000           Heart
1    Amanda   25            6    36000  Administrative
2   Pugsley    4            1  1000000          Doctor
3     Avery   31           10    78000    Supply Chain
4  Phylicia   35           15    90000  Administrative
5    Jordan   31           16    87000           Heart
6   Brendan   30           21    67000    Supply Chain
7     Jimmy   35            9    74000       Logistics
8     Sidni   17            8   210000         Stunin'

In [4]:
from pyspark.sql import SparkSession

In [5]:
spark = SparkSession.builder.appName('Practice').getOrCreate()

c:\users\jared\appdata\local\programs\python\python36\lib\site-packages\pyspark\context.py:238: FutureWarning: Python 3.6 support is deprecated in Spark 3.2.
  FutureWarning

In [6]:
spark

In [7]:
df_pyspark=spark.read.csv('fake.csv')

In [8]:
df_pyspark

DataFrame[_c0: string, _c1: string, _c2: string, _c3: string, _c4: string]

In [9]:
df_spark=spark.read.option('header','true').csv('fake.csv')

In [10]:
type(df_spark)

pyspark.sql.dataframe.DataFrame

In [11]:
df_spark.head(10)

[Row(Name='John', Age='40', Experience ='5', Salary='35000', Departments='Heart'),
 Row(Name='Amanda', Age='25', Experience ='6', Salary='36000', Departments='Administrative'),
 Row(Name='Pugsley', Age='4', Experience ='1', Salary='1000000', Departments='Doctor'),
 Row(Name='Avery', Age='31', Experience ='10', Salary='78000', Departments='Supply Chain'),
 Row(Name='Phylicia', Age='35', Experience ='15', Salary='90000', Departments='Administrative'),
 Row(Name='Jordan', Age='31', Experience ='16', Salary='87000', Departments='Heart'),
 Row(Name='Brendan', Age='30', Experience ='21', Salary='67000', Departments='Supply Chain'),
 Row(Name='Jimmy', Age='35', Experience ='9', Salary='74000', Departments='Logistics'),
 Row(Name='Sidni', Age='17', Experience ='8', Salary='210000', Departments="Stunin'")]

In [12]:
df_spark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: string (nullable = true)
 |-- Experience : string (nullable = true)
 |-- Salary: string (nullable = true)
 |-- Departments: string (nullable = true)